### สถานการณ์ที่ 1: การเชื่อมต่อ Router กับ Router (P2P Link)

สถานการณ์นี้คือพื้นฐานที่สุด คือการกำหนด IP ให้ Interface เพื่อให้ Router คุยกันรู้เรื่อง

**สิ่งที่ต้องทำ:**

1. เปิดใช้งาน IPv6
2. กำหนด Global Address
3. (แนะนำ) กำหนด Link-Local Address เพื่อให้ง่ายต่อการจดจำเวลาทำ Routing

**Configuration:**
```cisco
Router(config)# ipv6 unicast-routing           ! ห้ามลืม! ต้องเปิดก่อนเสมอ
Router(config)# interface serial 0/0/0
Router(config-if)# ipv6 address 2001:db8:acad:1::1/64    ! กำหนด Global IP
Router(config-if)# ipv6 address fe80::1 link-local       ! กำหนด Link-Local เป็นเลขง่ายๆ
Router(config-if)# no shutdown
```
(ฝั่งตรงข้ามก็ตั้งค่าคล้ายกัน แต่เปลี่ยน Global IP เป็น `::2` และ Link-Local เป็น `fe80::2`)
***
### สถานการณ์ที่ 2: การแจก IP แบบ SLAAC (Stateless Address Autoconfiguration)

สถานการณ์นี้คือ **Default** ของ IPv6 เมื่อเสียบสาย LAN เครื่อง PC จะได้รับ IP อัตโนมัติโดยไม่ต้องตั้งค่า DHCP Server เลย (PC จะสร้าง IP เองโดยใช้ Prefix ที่ Router ส่งมา + MAC Address ของตัวเอง)

**สิ่งที่ต้องทำ:**
- แค่กำหนด IP ให้ Router Interface นั้นๆ ระบบจะส่ง Router Advertisement (RA) ออกไปเอง

**Configuration:**
```cisco
Router(config)# ipv6 unicast-routing

Router(config)# interface gigabitethernet 0/0
Router(config-if)# ipv6 address 2001:db8:cafe:1::1/64
Router(config-if)# no shutdown
! ไม่ต้องทำอะไรเพิ่ม PC จะได้รับ IP prefix 2001:db8:cafe:1::/64 ไปสร้าง IP เอง
```
***
### สถานการณ์ที่ 3: การแจก IP แบบ Stateless DHCPv6 (SLAAC + DNS)

สถานการณ์นี้คือ "Client จ๋า... เธอสร้าง IP เองนะ (SLAAC) แต่ช่วยมาเอา DNS Server ที่ฉันหน่อย" (เพราะ SLAAC แจก DNS ไม่ได้ในมาตรฐานเก่า)

**สิ่งที่ต้องทำ:**

1. สร้าง DHCP Pool (ใส่แค่ DNS)
2. ตั้งค่า Flag `other-config-flag` บน Interface เพื่อบอก PC ว่า "มีข้อมูล _อื่นๆ_ (Other) ให้ไปถาม DHCP นะ"

**Configuration:**
```cisco
! 1. สร้าง Pool สำหรับแจก DNS
Router(config)# ipv6 dhcp pool IPV6-DNS-ONLY
Router(config-dhcpv6)# dns-server 2001:db8:cafe::254
Router(config-dhcpv6)# domain-name example.com

! 2. ผูกกับ Interface
Router(config)# interface gigabitethernet 0/0
Router(config-if)# ipv6 address 2001:db8:cafe:1::1/64
Router(config-if)# ipv6 nd other-config-flag        ! บอก Client ให้ไปถาม DHCP เรื่องอื่นๆ (DNS)
Router(config-if)# ipv6 dhcp server IPV6-DNS-ONLY
```

***
### สถานการณ์ที่ 4: การแจก IP แบบ Stateful DHCPv6 (Full DHCP)

สถานการณ์นี้เหมือน IPv4 คือ Router/Server เป็นคนกำหนด IP Address ให้เครื่องลูกข่ายทั้งหมด (Client ไม่ต้องสร้างเอง) เหมาะสำหรับองค์กรที่ต้องการคุม IP

**สิ่งที่ต้องทำ:**

1. สร้าง DHCP Pool (ใส่ Address Prefix และ DNS)
2. ตั้งค่า Flag `managed-config-flag` เพื่อบอก PC ว่า "ให้ _จัดการ_ (Manage) IP โดย DHCP ทั้งหมด"

**Configuration:**
```cisco
! 1. สร้าง Pool แบบเต็มรูปแบบ
Router(config)# ipv6 dhcp pool IPV6-FULL-STATEFUL
Router(config-dhcpv6)# address prefix 2001:db8:cafe:1::/64
Router(config-dhcpv6)# dns-server 2001:db8:cafe::254
Router(config-dhcpv6)# domain-name example.com

! 2. ผูกกับ Interface
Router(config)# interface gigabitethernet 0/0
Router(config-if)# ipv6 address 2001:db8:cafe:1::1/64
Router(config-if)# ipv6 nd managed-config-flag      ! บอก Client ให้ขอ IP จาก DHCP
Router(config-if)# ipv6 nd prefix-default no-autoconfig ! (Optional) สั่งห้ามสร้าง IP เองผ่าน SLAAC
Router(config-if)# ipv6 dhcp server IPV6-FULL-STATEFUL
```
***
### สถานการณ์ที่ 5: การทำ Routing (Static Route)

สถานการณ์เมื่อต้องการเชื่อมต่อเครือข่ายปลายทางแบบระบุเอง

**Configuration:**
```cisco
! รูปแบบ: ipv6 route <ปลายทาง> <ทางออก หรือ Next-Hop IP>

! ไปยังเครือข่าย 2001:db8:acad:2::/64 โดยส่งไปที่ Router เพื่อนบ้าน (fe80::2)
Router(config)# ipv6 route 2001:db8:acad:2::/64 serial 0/0/0 fe80::2

! Default Route (ออกเน็ต)
Router(config)# ipv6 route ::/0 serial 0/0/1
```
***
### สถานการณ์ที่ 6: การทำ Dynamic Routing (EIGRPv6)

สถานการณ์สำหรับเครือข่ายขนาดกลาง-ใหญ่ ให้ Router คุยแลกเปลี่ยนเส้นทางกันเอง

**สิ่งที่ต้องทำ:**

1. สร้าง EIGRP Process และสั่ง `no shutdown` (สำคัญมาก เพราะ Default มันปิดอยู่)
2. ประกาศ EIGRP ลงใน Interface

**Configuration:**
```cisco
! 1. สร้าง Process
Router(config)# ipv6 router eigrp 10
Router(config-rtr)# eigrp router-id 1.1.1.1     ! ต้องใส่ ID (ใช้รูปแบบ IPv4)
Router(config-rtr)# no shutdown                 ! **ห้ามลืมบรรทัดนี้เด็ดขาด**

! 2. ประกาศลง Interface (ทำทุก Interface ที่ต้องการให้รัน EIGRP)
Router(config)# interface gigabitethernet 0/0
Router(config-if)# ipv6 eigrp 10

Router(config)# interface serial 0/0/0
Router(config-if)# ipv6 eigrp 10
```

### สรุปคำสั่งตรวจสอบที่ใช้บ่อยที่สุด (Verification)

ไม่ว่าจะสถานการณ์ไหน หลังจาก Config เสร็จควรตรวจสอบด้วยคำสั่งเหล่านี้:

- `show ipv6 interface brief` (ดูว่า IP ขึ้นไหม Status Up หรือเปล่า)
- `show ipv6 route` (ดูว่ารู้จักเส้นทางที่จะไปไหม)
- `ping <ipv6-address>` (ลองยิงทดสอบการเชื่อมต่อ)